🐛 fix: Following badge 404, replace mermaid with ASCII diagram
